import { Coordinate } from "gridboard";

export const SCENE4_SAMPLE_RELATI_ROUTES_LIST = [
    [
        [[4, 3]],
        [[4, 5]],
        [[3, 4]],
        [[5, 4]]
    ],
    [
        [[3, 3]],
        [[3, 5]],
        [[5, 3]],
        [[5, 5]],
    ],
    [
        [[4, 3], [4, 3]],
        [[4, 5], [4, 6]],
        [[3, 4], [2, 4]],
        [[5, 4], [6, 4]],
    ],
    [
        [[3, 3], [2, 2]],
        [[3, 5], [2, 6]],
        [[5, 3], [6, 2]],
        [[5, 5], [6, 6]],
    ],
    [
        [[4, 3], [4, 2], [3, 2]],
        [[4, 5], [4, 6], [5, 6]],
        [[3, 4], [2, 4], [2, 5]],
        [[5, 4], [6, 4], [6, 3]],
    ],
    [
        [[3, 4], [3, 3], [3, 2]],
        [[5, 4], [5, 5], [5, 6]],
        [[4, 5], [3, 5], [2, 5]],
        [[4, 3], [5, 3], [6, 3]],
    ],
    [
        [[4, 3], [3, 3], [3, 2]],
        [[4, 5], [5, 5], [5, 6]],
        [[3, 4], [3, 5], [2, 5]],
        [[5, 4], [5, 3], [6, 3]],
    ],
    [
        [[4, 3], [4, 2], [5, 2]],
        [[4, 5], [4, 6], [3, 6]],
        [[3, 4], [2, 4], [2, 3]],
        [[5, 4], [6, 4], [6, 5]],
    ],
    [
        [[4, 3], [3, 3], [2, 3]],
        [[4, 5], [5, 5], [6, 5]],
        [[3, 4], [3, 5], [3, 6]],
        [[5, 4], [5, 3], [5, 2]],
    ],
    [
        [[4, 3], [5, 3], [5, 2]],
        [[4, 5], [3, 5], [3, 6]],
        [[3, 4], [3, 3], [2, 3]],
        [[5, 4], [5, 5], [6, 5]],
    ]
];

export const SCENE4_CAPTIONS = [
    "這是正四方近程連線！穩定但擴張速度較慢！",
    "這是正四方近程連線！穩定但擴張速度較慢！",
    "這是斜四方近程連線！穩定但是會產生破口！",
    "這是斜四方近程連線！穩定但是會產生破口！",
    "這是正四方遠程連線！不穩但擴張效果不錯！",
    "這是正四方遠程連線！不穩但擴張效果不錯！",
    "這是斜四方遠程連線！不穩但擴張效果最佳！",
    "這是斜四方遠程連線！不穩但擴張效果最佳！",
    "這是側八方遠程連線！擁有三種連線的方式！",
    "這是側八方遠程連線！擁有三種連線的方式！",
    "這是側八方遠程連線！擁有三種連線的方式！",
    "這是側八方遠程連線！擁有三種連線的方式！",
    "這是側八方遠程連線！擁有三種連線的方式！",
    "這是側八方遠程連線！擁有三種連線的方式！",
    "這是側八方遠程連線！比其他遠程連線穩定！",
    "這是側八方遠程連線！比其他遠程連線穩定！",
    "這是側八方遠程連線！比其他遠程連線穩定！",
    "這是側八方遠程連線！比其他遠程連線穩定！",
    "這是側八方遠程連線！比其他遠程連線穩定！",
    "這是側八方遠程連線！比其他遠程連線穩定！",
];

type Scene6Script = [string, number, Coordinate] | [string, number];

export const SCENE6_SCRIPTS: Scene6Script[] = [
    ["中間沒空格，被打斷了，如何接回去呢？", 2000, [5, 5]],
    ["中間沒空格，被打斷了，如何接回去呢？", 2000, [5, 5]],
    ["現在作為藍方，如何再打斷紅方呢？", 2000],
    ["自動放置中(紅方)", 2000, [2, 2]],
    ["自動放置中(藍方)", 500, [5, 2]],
    ["自動放置中(紅方)", 500, [2, 1]],
    ["自動放置中(藍方)", 500, [3, 3]],
];
